## Staging: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_docdb_cluster_parameter_group.feedback_cronjob_docdb_cluster_parameter_group will be created
  + resource "aws_docdb_cluster_parameter_group" "feedback_cronjob_docdb_cluster_parameter_group" {
      + arn         = (known after apply)
      + description = "Parameter group for feedback-cronjob staging DocumentDB"
      + family      = "docdb5.0"
      + id          = (known after apply)
      + name        = "feedback-cronjob-docdb-cluster-parameter-group"
      + name_prefix = (known after apply)
      + tags        = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }

      + parameter {
          + apply_method = "pending-reboot"
          + name         = "tls"
          + value        = "enabled"
        }
    }

  # aws_docdb_subnet_group.feedback_cronjob_docdb_subnet_group will be created
  + resource "aws_docdb_subnet_group" "feedback_cronjob_docdb_subnet_group" {
      + arn         = (known after apply)
      + description = "Subnet group for DocumentDB for the feedback-cronjob staging app"
      + id          = (known after apply)
      + name        = "feedback-cronjob-docdb-subnet-group"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-089ba77b72ba4e7ef",
          + "subnet-08d75a1492fee6cbd",
        ]
      + tags        = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_security_group.feedback_cronjob_docdb_sg will be created
  + resource "aws_security_group" "feedback_cronjob_docdb_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for DocumentDB for the feedback-cronjob app"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + from_port        = 27017
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 27017
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "feedback-cronjob-docdb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = "vpc-0936ad5356ea0fe6d"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_docdb_security_group_id = (known after apply)
14:42:13.293 WARN   The `TERRAGRUNT_FORWARD_TF_STDOUT` environment variable is deprecated and will be removed in a future version of Terragrunt. Use `TG_TF_FORWARD_STDOUT=true` instead.

Error: reading SSM Parameter (): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: 2e95e573-33c7-4998-99fe-53d2affcaca0, api error ValidationException: 1 validation error detected: Value '' at 'name' failed to satisfy constraint: Member must have length greater than or equal to 1

  with data.aws_ssm_parameter.docdb_username,
  on documentdb.tf line 4, in data "aws_ssm_parameter" "docdb_username":
   4: data "aws_ssm_parameter" "docdb_username" {


Error: reading SSM Parameter (): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: 349b43be-2626-46e3-9971-1ac5706b12de, api error ValidationException: 1 validation error detected: Value '' at 'name' failed to satisfy constraint: Member must have length greater than or equal to 1

  with data.aws_ssm_parameter.docdb_password,
  on documentdb.tf line 8, in data "aws_ssm_parameter" "docdb_password":
   8: data "aws_ssm_parameter" "docdb_password" {

14:42:27.498 ERROR  terraform invocation failed in ./.terragrunt-cache/n-n5emUQ11ggl2B7bkAM1H88vyY/cyQbY83knPoiLGrCPuFilp4R96k/database
14:42:27.498 ERROR  error occurred:

* Failed to execute "terraform plan -input=false -out=plan.tfplan -no-color" in ./.terragrunt-cache/n-n5emUQ11ggl2B7bkAM1H88vyY/cyQbY83knPoiLGrCPuFilp4R96k/database
  
  Error: reading SSM Parameter (): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: 2e95e573-33c7-4998-99fe-53d2affcaca0, api error ValidationException: 1 validation error detected: Value '' at 'name' failed to satisfy constraint: Member must have length greater than or equal to 1
  
    with data.aws_ssm_parameter.docdb_username,
    on documentdb.tf line 4, in data "aws_ssm_parameter" "docdb_username":
     4: data "aws_ssm_parameter" "docdb_username" {
  
  
  Error: reading SSM Parameter (): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: 349b43be-2626-46e3-9971-1ac5706b12de, api error ValidationException: 1 validation error detected: Value '' at 'name' failed to satisfy constraint: Member must have length greater than or equal to 1
  
    with data.aws_ssm_parameter.docdb_password,
    on documentdb.tf line 8, in data "aws_ssm_parameter" "docdb_password":
     8: data "aws_ssm_parameter" "docdb_password" {
  
  
  exit status 1


```

</details>

